app/controllers/tab_controller.rb

SELECT "tabs".* FROM "tabs"
---
  def index
    @tabs = Tab.all