app/controllers/tab_controller.rb

INSERT INTO "items" ("price", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["price", 0], ["created_at", "2015-10-21 06:43:59.689201"], ["updated_at", "2015-10-21 06:43:59.689201"]]
INSERT INTO "tabs" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2015-10-21 06:31:19.748725"], ["updated_at", "2015-10-21 06:31:19.748725"]]
SELECT  "rabbits".* FROM "rabbits" WHERE "rabbits"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."tab_id" IN (1)
UPDATE "items" SET "tab_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["tab_id", 1], ["updated_at", "2015-10-21 06:31:19.751506"], ["id", 1]]
---
  def new
    tab = Tab.new(name: "Untitled Tab")
    tab.items << Item.create(price: 0)
    tab.user = @user
    tab.rabbits << Rabbit.find(@user.avatar_rabbit_id)
    tab.save!

SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 10]]
SELECT "items".* FROM "items" WHERE "items"."tab_id" IN (10)
SELECT "rabbits".* FROM "rabbits" WHERE "rabbits"."id" IN (1)
---
  def edit
    tab_id = params[:id]
    @tab = Tab.includes(:rabbits).includes(:items).find(tab_id)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "tabs".* FROM "tabs" WHERE "tabs"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "items" SET "name" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["name", ""], ["updated_at", "2015-10-22 06:46:42.345909"], ["id", 2]]
UPDATE "tabs" SET "name" = $1, "updated_at" = $2 WHERE "tabs"."id" = $3  [["name", "Untitled Tabola"], ["updated_at", "2015-10-22 06:20:31.324264"], ["id", 1]]
---
  def update
    tab_id = params[:id]
    updatedItems = params[:items]
    updatedTab = params[:tab]

    @tab = Tab.includes(:items).find(tab_id)
    puts @tab.update(name: updatedTab[:name])